Documents/бит_КорректировкаПоказанийСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_КорректировкаПоказанийСчетчиков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ПоказанияСчетчиков</xr:Item>
				<xr:Item>InformationRegister.бит_СведенияОКорректировкеНачальныхПоказаний</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидОперацииКорректировкиПоказанийСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ИсточникПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировочныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Многотарифный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленияЗаПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследниеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленияЗаПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследниеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_КолЕдиницПоСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_КолЕдиницПоСчетчикам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПоЛС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдПодкрутка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/бит_ВидОперацииКорректировкиПоказанийСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидОперацииКорректировкиПоказанийСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОшибочныхПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНачальныхПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПодкрутки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_КорректировкаПоказанийСчетчиков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрочиеПроцедурыИФункции

Функция РасчитатьРазовыеПоКорректировке(Ссылка, Дата) Экспорт
	
	ТаблицаРазовых = Новый ТаблицаЗначений;
	ТаблицаРазовых.Колонки.Добавить("Услуга"            , Новый ОписаниеТипов("СправочникСсылка.бит_УслугиЖКХ"));
	ТаблицаРазовых.Колонки.Добавить("ЛицевойСчет"       , Новый ОписаниеТипов("СправочникСсылка.бит_ЛицевыеСчета"));
	ТаблицаРазовых.Колонки.Добавить("Счетчик"           , Новый ОписаниеТипов("СправочникСсылка.бит_Счетчики"));
	ТаблицаРазовых.Колонки.Добавить("КоличествоЕдиниц"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ТаблицаРазовых.Колонки.Добавить("НачисленияЗаПериод", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаРазовых.Колонки.Добавить("Сумма"             , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	// БИТ_ЖКХ 28.05.2014
	ТаблицаРазовых.Колонки.Добавить("Объем"             , ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	// БИТ_ЖКХ 28.05.2014
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"        , КонецДня(Дата));
	Запрос.УстановитьПараметр("Ссылка"      , Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Период,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.НачальныеПоказания,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.КорректировочныеПоказания,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ДатаНачала,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.НачисленияЗаПериод,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ДатаОтПоказаний,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ИсточникПоказаний,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Многотарифный,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Услуга,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.бит_КорректировкаПоказанийСчетчиков.КорректировкаПоказаний КАК бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний
	|ГДЕ
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Ссылка = &Ссылка
	|	И бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Многотарифный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Период,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.НачальныеПоказания,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.КорректировочныеПоказания,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ДатаНачала,
	|	бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.НачисленияЗаПериод,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ДатаОтПоказаний,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ИсточникПоказаний,
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Многотарифный,
	|	бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Услуга,
	|	бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.ПоследниеПоказания
	|ИЗ
	|	Документ.бит_КорректировкаПоказанийСчетчиков.КорректировкаПоказаний КАК бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_КорректировкаПоказанийСчетчиков.ТаблицаУслуг КАК бит_КорректировкаПоказанийСчетчиковТаблицаУслуг
	|		ПО бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.ЛицевойСчет = бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.ЛицевойСчет
	|			И бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Счетчик = бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Счетчик
	|ГДЕ
	|	бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Ссылка = &Ссылка
	|	И НЕ бит_КорректировкаПоказанийСчетчиковКорректировкаПоказаний.Многотарифный
	|	И бит_КорректировкаПоказанийСчетчиковТаблицаУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира
	|ПОМЕСТИТЬ СведенияоКвартире
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, ) КАК бит_СведенияОКвартиреСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПрожив
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					Таб.ЛицевойСчет
	|				ИЗ
	|					ТаблицаДокумента КАК Таб)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|ПОМЕСТИТЬ СведенияПоУслугам
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.ЛицевойСчет,
	|	ТаблицаДокумента.Счетчик,
	|	ТаблицаДокумента.НачальныеПоказания,
	|	ТаблицаДокумента.КорректировочныеПоказания,
	|	ТаблицаДокумента.ДатаНачала,
	|	ТаблицаДокумента.НачисленияЗаПериод,
	|	ТаблицаДокумента.ДатаОтПоказаний,
	|	ТаблицаДокумента.ИсточникПоказаний,
	|	ТаблицаДокумента.Многотарифный,
	|	ТаблицаДокумента.Услуга,
	|	СведенияПоУслугам.РежимПотребления,
	|	СведенияПоУслугам.Поставщик,
	|	СведенияоКвартире.ТипКвартиры,
	|	СведенияоКвартире.СтатусКвартиры,
	|	Проживающие.КолПрожив,
	|	ТаблицаДокумента.ПоследниеПоказания
	|ПОМЕСТИТЬ СводнаяТаблицаСведений
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияоКвартире КАК СведенияоКвартире
	|		ПО ТаблицаДокумента.ЛицевойСчет.Квартира = СведенияоКвартире.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
	|		ПО ТаблицаДокумента.ЛицевойСчет = Проживающие.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияПоУслугам КАК СведенияПоУслугам
	|		ПО ТаблицаДокумента.Услуга = СведенияПоУслугам.Услуга
	|			И ТаблицаДокумента.ЛицевойСчет = СведенияПоУслугам.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА СводнаяТаблицаСведений.КолПрожив = 1
	|				ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СводнаяТаблицаСведений.КолПрожив = 2
	|						ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА СводнаяТаблицаСведений.КолПрожив = 3
	|								ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|							ИНАЧЕ ВЫБОР
	|									КОГДА СводнаяТаблицаСведений.КолПрожив = 4
	|										ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА СводнаяТаблицаСведений.КолПрожив = 5
	|												ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|											ИНАЧЕ ВЫБОР
	|													КОГДА СводнаяТаблицаСведений.КолПрожив > 5
	|														ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) + ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0)
	|													ИНАЧЕ 0
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ * СводнаяТаблицаСведений.КолПрожив + ВЫБОР
	|			КОГДА СводнаяТаблицаСведений.КолПрожив = 1
	|					И ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ)
	|				ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СводнаяТаблицаСведений.КолПрожив = 2
	|						ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|					ИНАЧЕ ВЫБОР
	|							КОГДА СводнаяТаблицаСведений.КолПрожив > 2
	|								ТОГДА ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ * СводнаяТаблицаСведений.КолПрожив, 0) КАК Норма,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ПлановаяСтавка, 0) КАК ПлановаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.ОсновнаяСтавка, 0) КАК ОсновнаяСтавка,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.СверхНормативнаяСтавка, 0) КАК СверхНормативнаяСтавка,
	|	СводнаяТаблицаСведений.Период,
	|	СводнаяТаблицаСведений.ЛицевойСчет,
	|	СводнаяТаблицаСведений.Счетчик,
	|	СводнаяТаблицаСведений.НачальныеПоказания,
	|	СводнаяТаблицаСведений.КорректировочныеПоказания,
	|	СводнаяТаблицаСведений.ДатаНачала,
	|	СводнаяТаблицаСведений.НачисленияЗаПериод,
	|	СводнаяТаблицаСведений.ДатаОтПоказаний,
	|	СводнаяТаблицаСведений.ИсточникПоказаний,
	|	СводнаяТаблицаСведений.Многотарифный,
	|	СводнаяТаблицаСведений.Услуга,
	|	СводнаяТаблицаСведений.РежимПотребления,
	|	СводнаяТаблицаСведений.Поставщик,
	|	СводнаяТаблицаСведений.ТипКвартиры,
	|	СводнаяТаблицаСведений.СтатусКвартиры,
	|	СводнаяТаблицаСведений.КолПрожив,
	|	СводнаяТаблицаСведений.ПоследниеПоказания
	|ИЗ
	|	СводнаяТаблицаСведений КАК СводнаяТаблицаСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&Дата, СпособРасчетаПоУслуге = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО СводнаяТаблицаСведений.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И СводнаяТаблицаСведений.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И СводнаяТаблицаСведений.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|			И СводнаяТаблицаСведений.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&Дата, СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)) КАК бит_СтавкиНаУслугиСрезПоследних
	|		ПО СводнаяТаблицаСведений.Услуга = бит_СтавкиНаУслугиСрезПоследних.Услуга
	|			И СводнаяТаблицаСведений.РежимПотребления = бит_СтавкиНаУслугиСрезПоследних.РежимПотребления
	|			И СводнаяТаблицаСведений.Поставщик = бит_СтавкиНаУслугиСрезПоследних.Поставщик
	|			И СводнаяТаблицаСведений.ТипКвартиры = бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры
	|			И СводнаяТаблицаСведений.СтатусКвартиры = бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияоКвартире
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Проживающие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияПоУслугам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СводнаяТаблицаСведений";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	ВидОперации = Ссылка.ВидОперации;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НачисленияЗаПериод > 0 Тогда	
			
			НоваяСтрока = ТаблицаРазовых.Добавить();
			НоваяСтрока.ЛицевойСчет      = Выборка.ЛицевойСчет;
			НоваяСтрока.Услуга           = Выборка.Услуга;
			НоваяСтрока.Счетчик          = Выборка.Счетчик;
			
			КоличествоЕдиниц = 0;
			
			Если ВидОперации = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаНачальныхПоказаний Тогда
				
				КоличествоЕдиниц = Выборка.НачальныеПоказания - Выборка.КорректировочныеПоказания;
				КоличествоЕдиниц = ?(КоличествоЕдиниц < 0, КоличествоЕдиниц * -1, КоличествоЕдиниц);
				
				СуммаСверхНорма = 0;
				
				Если Выборка.Норма < КоличествоЕдиниц Тогда
					СуммаСверхНорма = (КоличествоЕдиниц  - Выборка.Норма) * Выборка.СверхНормативнаяСтавка;
				КонецЕсли;
				
				Сумма = (КоличествоЕдиниц * Выборка.ОсновнаяСтавка) + СуммаСверхНорма;
				Сумма = ?(Сумма > Выборка.НачисленияЗаПериод, Выборка.НачисленияЗаПериод, Сумма);
				
				НоваяСтрока.КоличествоЕдиниц = КоличествоЕдиниц; 
				
				НоваяСтрока.Сумма = ?(Выборка.НачальныеПоказания > Выборка.КорректировочныеПоказания, Сумма, Сумма * -1);
				
			Иначе
				
				КоличествоЕдниницОстаток =  Выборка.КорректировочныеПоказания - Выборка.ПоследниеПоказания;
				КоличествоЕдиницЗаПериод = ПолучитьКоличествоЕдинциЗаПериод(КонецДня(Выборка.ДатаОтПоказаний), Дата, Выборка.ЛицевойСчет, Выборка.Счетчик, Выборка.Услуга);
				
				Если КоличествоЕдиницЗаПериод = 0  Тогда
					Продолжить;
				КонецЕсли; 
				
				Сумма = ОКР((Выборка.НачисленияЗаПериод/КоличествоЕдиницЗаПериод) * КоличествоЕдниницОстаток ,2);
								
				НоваяСтрока.НачисленияЗаПериод = Выборка.НачисленияЗаПериод;
				НоваяСтрока.КоличествоЕдиниц   =  КоличествоЕдниницОстаток;
				НоваяСтрока.Сумма = Сумма;
				
				// БИТ_ЖКХ 28.05.2014		
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.Тариф, 0) КАК Тариф,
				|	бит_СтавкиНаУслугиСрезПоследних.Период КАК Период
				|ИЗ
				|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&Дата, ) КАК бит_СтавкиНаУслугиСрезПоследних
				|ГДЕ
				|	бит_СтавкиНаУслугиСрезПоследних.Услуга = &Услуга
				|	И бит_СтавкиНаУслугиСрезПоследних.СпособРасчета = &ПоСчетчикам
				|	И бит_СтавкиНаУслугиСрезПоследних.РежимПотребления = &РежимПотребления
				|	И бит_СтавкиНаУслугиСрезПоследних.Поставщик = &Поставщик
				|	И бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры = &ТипКвартиры
				|	И бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры = &СтатусКвартиры
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период";
				
				Запрос.УстановитьПараметр("Дата", Дата);
				Запрос.УстановитьПараметр("Услуга", Выборка.Услуга);
				Запрос.УстановитьПараметр("ПоСчетчикам", ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам"));
				Запрос.УстановитьПараметр("Поставщик", Выборка.Поставщик);
				Запрос.УстановитьПараметр("РежимПотребления", Выборка.РежимПотребления);
				Запрос.УстановитьПараметр("ТипКвартиры", Выборка.ТипКвартиры);
				Запрос.УстановитьПараметр("СтатусКвартиры", Выборка.СтатусКвартиры);
				
				Результат = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Тариф) Тогда	
						НоваяСтрока.Объем   =  НоваяСтрока.Сумма/ВыборкаДетальныеЗаписи.Тариф;
					Иначе
						НоваяСтрока.Объем   = 0;
					КонецЕсли;		
					
				КонецЦикла;
				// БИТ_ЖКХ 28.05.2014
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРазовых;
	
КонецФункции // ()

// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьКоличествоЕдинциЗаПериод(НачалоПериода, КонецПериода, ЛицевойСчет, Счетчик, Услуга)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" , КонецПериода);
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ЛицевойСчет);
	Запрос.УстановитьПараметр("Счетчик"      , Счетчик);
	Запрос.УстановитьПараметр("Услуга"       , Услуга);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдиницПоЛСОборот, 0) + ЕСТЬNULL(бит_КолЕдиницПоСчетчикамОбороты.КоличествоЕдПодкруткаОборот, 0)) КАК КоличествоЕдиниц,
	|	бит_КолЕдиницПоСчетчикамОбороты.Счетчик
	|ИЗ
	|	РегистрНакопления.бит_КолЕдиницПоСчетчикам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Счетчик = &Счетчик
	|				И УслугаЖКХ = &Услуга) КАК бит_КолЕдиницПоСчетчикамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_КолЕдиницПоСчетчикамОбороты.Счетчик";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.КоличествоЕдиниц;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ()

#КонецОбласти

#КонецЕсли
